/* 
Операція ... (rest) дозволяє зібрати групу 
незалежних елементів у нову колекцію. 
Синтаксично - це близнюк операції розподілу, 
але відрізнити їх просто - розподіл - коли ... 
знаходиться у правій частині операції присвоювання, 
а збирання - коли ... знаходиться в її лівій частині.
*/

const arr = [1, 2, 3, 4, 5];

/* const arr = [1, 2, 3, 4, 4, 5, 6];
const newArr = [...arr];
function foo(x, y, ...test) {
  console.log(test);
}
foo(1, 2, 3, 4, 6, 7, 8, 9, 4, 1, `32w`); */

/* 
Збирання остаточних параметрів
*/
