/*

 - Не змінює оригінальний масив.
 - Поелементо перебирає оригінальний масив.
 - Повертає новий масив.
 - Додає у масив, що повертається, елементи, які задовольняють умови колбек-функції.
 - Якщо колбек повернув true, елемент додається у масив, що повертається.
 - Якщо колбек повернув false, елемент не додається у масив, що повертається.
 - Якщо жоден елемент не задовольнив умову, повертає порожній масив.

*/

// let array = [1, -53, 56, -5, 1, 5, -6, 78, 2, -1, 6];

// const result = array.filter(el => {
//   return el % 2 === 0;
// });

// const result = array.filter(el => el >= 0);

// console.log(array);
// console.log(result);
