/* 
Створіть клас "Фігура" з приватними властивостями
"ширина" і "висота". У класі "Фігура" також повинні бути методи для
обчислення площі та периметра фігури. Створіть підкласи "Прямокутник" і
"Квадрат", які успадковують властивості і методи від класу "Фігура". У підкласах
перевизначте конструктор таким чином, щоб він приймав лише один параметр
(довжину сторони для квадрата і довжину і ширину для прямокутника). Перевірте
роботу класів, створивши об'єкти "Прямокутник" і "Квадрат" і використовуючи їх
методи для обчислення площі і периметра.
*/
